tutorials/mesh/snappyHexMesh/multiRegionMesh/system/README
fvSolution is used for outer correctors specification.
fvSchemes is only so that pre-processing activities can proceed

