tutorials/mesh/snappyHexMesh/multiRegionMesh/system/leftSolid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        leftSolid_to_bottomAir
        {
            offset          ( 0 0 0 );
            sampleMode      nearestPatchFace;
            sampleRegion    bottomAir;
            samplePatch     bottomAir_to_leftSolid;
        }
        leftSolid_to_heater
        {
            offset          ( 0 0 0 );
            sampleMode      nearestPatchFace;
            sampleRegion    heater;
            samplePatch     heater_to_leftSolid;;
        }
        leftSolid_to_topAir
        {
            offset          ( 0 0 0 );
            sampleMode      nearestPatchFace;
            sampleRegion    topAir;
            samplePatch     topAir_to_leftSolid;;
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            leftSolid_to_bottomAir
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourFieldName T;
                K               K;
                value           uniform 300;

            }
            leftSolid_to_heater
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourFieldName T;
                K               K;
                value           uniform 300;
            }
            leftSolid_to_topAir
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourFieldName T;
                K               K;
                value           uniform 300;
            }
        }
    }

    rho
    {
        internalField   uniform 8000;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            leftSolid_to_bottomAir
            {
                type            zeroGradient;
            }
            leftSolid_to_heater
            {
                type            zeroGradient;
            }
            leftSolid_to_topAir
            {
                type            zeroGradient;
            }
        }
    }

    K
    {
        internalField   uniform 80;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            leftSolid_to_bottomAir
            {
                type            zeroGradient;
            }
            leftSolid_to_heater
            {
                type            zeroGradient;
            }
            leftSolid_to_topAir
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            leftSolid_to_bottomAir
            {
                type            zeroGradient;
            }
            leftSolid_to_heater
            {
                type            zeroGradient;
            }
            leftSolid_to_topAir
            {
                type            zeroGradient;
            }
        }
    }
}

// ************************************************************************* //
